CATEGORIES = [
    "Продукты",
    "Транспорт", 
    "Развлечения",
    "Техника",
    "Хобби",
    "Здоровье",
    "Вредные привычки",
    "Одежда",
    "Кафе",
    "Красота",
    "Путешествия",
    "Дом и быт",
    "Постоянные расходы",
    "Прочее"
]

CATEGORY_COLORS = {
    "Продукты": "#2ECC71",
    "Кафе": "#E67E22",
    "Транспорт": "#3498DB",
    "Жильё": "#95A5A6",
    "Постоянные расходы": "#7F8C8D",
    "Развлечения": "#9B59B6",
    "Хобби": "#1ABC9C",
    "Техника": "#34495E",
    "Здоровье": "#27AE60",
    "Красота": "#FF69B4",
    "Одежда": "#E91E63",
    "Путешествия": "#00BCD4",
    "Вредные привычки": "#E74C3C",
    "Дом и быт": "#8D6E63",
    "Прочее": "#BDC3C7"
}

DEFAULT_COLOR = "#95A5A6" 